#!/opt/bin/php
<?php
echo "Content-type: text/html\n";
echo "\n";

//********************************************************************
// Извлекаем параметры из HTTP-запроса в список
//********************************************************************
function get_query_var ($s1)
  {
//   echo "s1= ".$s1."<br>";
   $s2 = explode("&", $s1); // разбить строку запроса на элементы, разделенные &
   $n1 =  sizeof($s2);          // получить кол-во переменных
   for ($n2=0; $n2 < $n1; $n2++)
         {
// разделить переменные и значения по отдельным элементам массива
           $s3[$n2] = explode("=", $s2[$n2]);  // разбить элемент массива, на элементы, разделенные &
// Декодирование значений найденных переменной и вставка пробелов
           $s3 [$n2][1] = rawurldecode($s3 [$n2][1]);
           $s3 [$n2][1] = str_replace("+"," ",$s3 [$n2][1]);
         }
//   echo "<pre>";
//   print_r ($s3);
//   echo "</pre>";
   return $s3;
  }

//********************************************************************
//Поиск в сформированном списке запроса, необходимой переменной
// если значение первого элемента массива = названию переменной, то вернуть значение второго элемента
//********************************************************************
function find_query_var ($s1,$keyword)
  {
//    echo "keyword= ".$keyword."<br>";
   $n1 =  sizeof ($s1);          // получить кол-во элементов массива переменных запроса
   for ($n2=0; $n2 < $n1; $n2++)
         {
//           print $s1[$n2][0]."=".$s1[$n2][1]."<br>";
           if ($s1[$n2][0] == $keyword) 
             {
               $res = $s1[$n2][1];
             }
         }

    if (isset($res))
      {
        return $res;
      }
    else
      {
        echo "<b>var res is not set </b><br>"; 
      }
  }

//********************************************************************
// получить переменные запроса, через разбор функциями строки запроса
//********************************************************************
function  cli_get_query_var1 ($name_var)
  {
    // проверить наличие CGI-переменных массива _SERVER
    if (isset($_SERVER['CGI_'.$name_var]))
      {
         $res = $_SERVER['CGI_'.$name_var];
         $s1 = ""; // строка запроса больше не нужна
       }

    if (isset($res))
      {
        print "<b>res = ".$res."</b><br>\n";
        return $res;
      }
   else
     {
        echo "<b>var res is not set </b><br>"; 
     }
  }

//********************************************************************
// получить переменные запроса, через разбор функциями строки запроса
//********************************************************************
function  cli_get_query_var2 ($name_var)
  {
    global $s1;
   //  выделить переменные из строки запроса s1
    if ($s1 > "") 
      {
//         print $s1."<br>\n";
         $list_query = get_query_var ($s1);
//       print "list_query= <br>";
//       echo "<pre>";
//       print_r ($list_query);
//       echo "</pre>";
// в массиве переменных запроса, найти переменную name_var
         $res = find_query_var ($list_query, $name_var);
      }

    if (isset($res))
      {
        print "<b>res = ".$res."</b><br>\n";
        return $res;
      }
   else
     {
        echo "<b>var res is not set </b><br>"; 
     }
  }

//********************************************************************
// получить переменные запроса, через массив GET
//********************************************************************
function  mod_get_query_var1 ($name_var)
  {
    $res = $_GET [$name_var];
//    print "<b>res = ".$res."</b><br>\n";
    if (isset($res))
      {
        return $res;
      }
    else
      {
        echo "<b>var res is not set </b><br>"; 
      }
  }

//********************************************************************
// получить переменные запроса, через массив POST
//********************************************************************
function  mod_get_query_var2 ($name_var)
  {
    $res = $_POST [$name_var];
//    print "<b>res = ".$res."</b><br>\n";
    if (isset($res))
      {
        return $res;
      }
    else
      {
        echo "<b>var res is not set </b><br>"; 
      }
  }

//****************************************
// main
//****************************************
//****************************************
// Определяем метод запроса
//****************************************
    if (isset($_SERVER ['REQUEST_METHOD']))
      {
        $query = $_SERVER ['REQUEST_METHOD'];
      }
//  print "<b>".$query."</b><br>\n";

//****************************************
// Определяем интерфейс между PHP и вебсервером (SAPI)
//****************************************
$sapi_type = php_sapi_name();
print "interface between web server and PHP - ".$sapi_type."<br>\n";

if ($sapi_type == 'cli')
  {
    echo "You are using Command line interface PHP\n";

//****************************************
// Извлекаем параметры из запроса GET
//****************************************
    if ($query == "GET")
      {
       $text1=cli_get_query_var1 ('text1'); // получить переменные запроса, через разбор функциями строки запроса
       $text2=cli_get_query_var1 ('text2'); // получить переменные запроса, через разбор функциями строки запроса
       $text3=cli_get_query_var1 ('text3'); // получить переменные запроса, через разбор функциями строки запроса
      }
//****************************************
// Извлекаем параметры из запроса POST
//****************************************
    if ($query == "POST")
       {
         // если массив  _POST пуст, то нужно считать строку запроса s1 со стандартного ввода
         $stdin = fopen ("php://stdin","r");
         if (!$stdin)
           {
             echo ("<b> error open stdin </b><br>");
           }
         else
           {
             $s1 = fgets(STDIN); // читаем строку из STDIN 
             print "S1 =".$s1." <br>";
           }
         $text1=cli_get_query_var2 ('text1'); // получить переменные запроса, через разбор функциями строки запроса
         $text2=cli_get_query_var2 ('text2'); // получить переменные запроса, через разбор функциями строки запроса
         $text3=cli_get_query_var2 ('text3'); // получить переменные запроса, через разбор функциями строки запроса
       }

  } 
else
  {
    if ($sapi_type == 'cgi')
      {
        echo "You are using Common Gateway Interface PHP\n";
      } 
    else
      {
        echo "You are using PHP as ".$sapi_type."<br>\n";
      }
//****************************************
// Извлекаем параметры из запроса GET
//****************************************
    if ($query == "GET")
      {
       $text1=mod_get_query_var1 ('text1'); // получить переменные запроса через массивы GET 
       $text2=mod_get_query_var1 ('text2'); // получить переменные запроса через массивы GET 
       $text3=mod_get_query_var1 ('text3'); // получить переменные запроса через массивы GET 
      }
//****************************************
// Извлекаем параметры из запроса POST
//****************************************
    if ($query == "POST")
      {
       $text1=mod_get_query_var2 ('text1'); // получить переменные запроса через массивы POST
       $text2=mod_get_query_var2 ('text2'); // получить переменные запроса через массивы POST
       $text3=mod_get_query_var2 ('text3'); // получить переменные запроса через массивы POST
      }
  }

//echo "<pre>";
//phpinfo();
//echo "</pre>";

//****************************************
// Печать переменных запроса
//****************************************
print "<ul>";
    echo "<pre>";
    echo "GLOBALS \n";
    echo " ****************************************\n";
    print_r ($GLOBALS)."\n";

    echo "SERVER \n";
    echo " ****************************************\n";
    print_r ($_SERVER)."\n";

//=====================================

    echo "GET \n";
    echo " ****************************************\n";
    print_r ($_GET)."\n";

    if (sizeof($_GET) > 0)
      {
        print "<b> ARRAY GET is SET</b><br>\n";
      }
    else
      {
        print "<b> ARRAY GET is not SET</b><br>\n";
      }
//=====================================

    echo "POST \n";
    echo " ****************************************\n";
    print_r ($_POST)."\n";

    if (sizeof($_POST) > 0)
      {
        print "<b> ARRAY POST is SET</b><br>\n";
      }
    else
      {
        print "<b> ARRAY POST is not SET</b><br>\n";
      }
//=====================================

    echo "COOKIE \n";
    echo " ****************************************\n";
    print_r ($_COOKIE)."\n";

    echo "FILES \n";
    echo " ****************************************\n";
    print_r ($_FILES)."\n";

    echo "ENV \n";
    echo " ****************************************\n";
    print_r ($_ENV)."\n";

    echo "REQUEST \n";
    echo " ****************************************\n";
    print_r ($_REQUEST)."\n";

    echo "SESSION \n";
    echo " ****************************************\n";
    print_r ($_SESSION)."\n";

    echo "</pre>";
    echo " ****************************************\n";

print "</ul>";
print "<hr>\n";


    echo "<pre>";
    print "GET = <br>";
    print_r ($_GET)."\n";

    print "<hr>";

    print "POST = <br>";
    print_r ($_POST)."\n";
    echo "</pre>";


   print "text1= ".$text1."<br>";
   print "text2= ".$text2."<br>";
   print "text3= ".$text3."<br>";

?>
